lookup.dictonary_uk_ua = 
{
    "картопля" : [ "продукти", "овочі"],
    "молоко" : [ "продукти", ""],
    "Апельсини": [ "продукти", ""],
    "Яблука":[ "продукти", ""],
    "Банани":[ "продукти", ""],
    "Салат-латук":[ "продукти", ""],
    "Помідори":[ "продукти", ""],
    "Молоко":[ "продукти", ""],
    "Сир":[ "продукти", ""],
    "Яйця":[ "продукти", ""],
    "Домашній сир":[ "продукти", ""],
    "Яловичина":[ "продукти", ""],
    "Птиця":[ "продукти", ""],
    "Шинка":[ "продукти", ""],
    "Сік":[ "продукти", ""],
    "Кава":[ "продукти", ""],
    "Чай":[ "продукти", ""],
    "Вода":[ "продукти", ""],
    "Локшина":[ "продукти", ""],
    "Рис":[ "продукти", ""],
    "Консерви":[ "продукти", ""],
    "Суха суміш":[ "продукти", ""],
    "Хліб":[ "продукти", ""],
    "Чіпси":[ "продукти", ""],
    "Кренделі":[ "продукти", ""],
    "Морозиво":[ "продукти", ""],
    "Печиво":[ "продукти", ""],
    "Одноразові тарілки":[ "продукти", ""],
    "Серветки":[ "продукти", ""]
};

lookup.assign_labels_by_dictionary = function(card)
{
    var textToSearch = card.text().toLowerCase();
    var found = lookup.dictonary_uk_ua[textToSearch];
    if(typeof(found) !== "undefined")
    {
        for(var x in found)
        {
            var label = found[x].trim();
            var obj = {
                text: label
                };
            lookup.CreateNote(obj, function(added)
            {
                lookup.ConnectNotes(card, added );
            })
        }

    }

};